
export const PlayGroundSize = {
    columns: 12,
    rows: 12
}

export const Ships = [
    {
        name: 'Loď 1',
        size: 6
    },
    {
        name: 'Loď 2',
        size: 5
    },
    {
        name: 'Loď 3',
        size: 4
    },
    {
        name: 'Loď 4',
        size: 3
    },
    {
        name: 'Loď 5',
        size: 2
    },
]

// TODO: zatiaľ nepoužívam, asi ani nebudem, keď tak potom vyhodiť

export const PlayGroundArray = [
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ,11, 12],
]